Backrooms/src/Enums/СтатусыМероприятий/СтатусыМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМероприятий</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликованное</name>
  </enumValues>
  <enumValues>
    <name>Внутреннее</name>
  </enumValues>
</mdclass:Enum>

Backrooms/src/Catalogs/Мероприятия/Мероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мероприятия</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйОрганизатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщедоступнаяРегистрация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКартинки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокУчастников</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Распределение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распределения</name>
    <attributes>
      <name>Распределение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аудитория</name>
      <type>
        <types>CatalogRef.Аудитории</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Backrooms/src/HTTPServices/ОтправкаПубличныхМероприятий/Module.bsl
Функция ОтправкаПубличныхGET(Запрос)
    
    // 1. Получаем параметр login из URL
    Логин = "";
    Попытка
        Логин = Запрос.ПараметрыЗапроса.Получить("login");
    Исключение
        Логин = "";
    КонецПопытки;

    // 2. Проверяем, что логин передан
    Если ПустаяСтрока(Логин) Тогда
        Ответ = Новый HTTPСервисОтвет(400);
        Ответ.УстановитьТелоИзСтроки("Не передан параметр login");
        Возврат Ответ;
    КонецЕсли;

    // 3. Формируем запрос к базе данных
    ЛокальныйЗапрос = Новый Запрос;
    ЛокальныйЗапрос.Текст =
        "ВЫБРАТЬ
        |    Мероприятия.Код КАК Код,
        |    Мероприятия.Наименование КАК Наименование,
        |    Мероприятия.ЧислоУчастников КАК ЧислоУчастников,
        |    Мероприятия.ОбщедоступнаяРегистрация КАК ОбщедоступнаяРегистрация,
        |    Мероприятия.ГлавныйОрганизатор.Наименование КАК ГлавныйОрганизаторНаименование,
        |    Мероприятия.Организация.Наименование КАК ОрганизацияНаименование,
        |    Мероприятия.ХранилищеКартинки КАК Картинка,
        |    Мероприятия.Статус КАК Статус
        |ИЗ
        |    Справочник.Мероприятия КАК Мероприятия
        |ГДЕ
        |    Мероприятия.ОбщедоступнаяРегистрация = ИСТИНА
        |    И Мероприятия.Статус = &Статус
        |	 И НЕ &Логин В (Мероприятия.СписокУчастников.Участник.Логин)";
        
    ЛокальныйЗапрос.УстановитьПараметр("Статус", Перечисления.СтатусыМероприятий.Опубликованное);
    ЛокальныйЗапрос.УстановитьПараметр("Логин", Логин);

    Попытка
        Результат = ЛокальныйЗапрос.Выполнить();
    Исключение
        Ответ = Новый HTTPСервисОтвет(500);
        Ответ.УстановитьТелоИзСтроки("Ошибка выполнения запроса: " + ОписаниеОшибки());
        Возврат Ответ;
    КонецПопытки;

    // 4. Преобразуем результат в массив структур
    МассивМероприятий = Новый Массив;
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        СтруктураМероприятия = Новый Структура;
        СтруктураМероприятия.Вставить("Код", Выборка.Код);
        СтруктураМероприятия.Вставить("Наименование", Выборка.Наименование);
        СтруктураМероприятия.Вставить("ЧислоУчастников", Выборка.ЧислоУчастников);
        СтруктураМероприятия.Вставить("ОбщедоступнаяРегистрация", Выборка.ОбщедоступнаяРегистрация);
        СтруктураМероприятия.Вставить("ГлавныйОрганизаторНаименование", Выборка.ГлавныйОрганизаторНаименование);
        СтруктураМероприятия.Вставить("ОрганизацияНаименование", Выборка.ОрганизацияНаименование);
        
        // Картинка: если поле содержит Base64-строку или двоичные данные, адаптируйте под свой тип
        Если ЗначениеЗаполнено(Выборка.Картинка) Тогда
            // Если это строка Base64 – передаём как есть
            СтруктураМероприятия.Вставить("КартинкаBase64", Выборка.Картинка);
        Иначе
            СтруктураМероприятия.Вставить("КартинкаBase64", "");
        КонецЕсли;
        
        СтруктураМероприятия.Вставить("Статус", Выборка.Статус);
        МассивМероприятий.Добавить(СтруктураМероприятия);
    КонецЦикла;

    // 5. Формируем JSON-ответ
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, МассивМероприятий);
    СтрокаJSON = ЗаписьJSON.Закрыть();

    Ответ = Новый HTTPСервисОтвет(200);
    Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
    Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
    Возврат Ответ;
    
КонецФункции
